src/SSL.Chat2Desk/src/InformationRegisters/C2D_Операторы/C2D_Операторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Операторы</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>avatar</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>first_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>last_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_ОповещенияОператоров/C2D_ОповещенияОператоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_ОповещенияОператоров</name>
  <resources>
    <name>Оповещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Operator_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Сообщения/C2D_Сообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Сообщения</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>dialog_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Диалоги/C2D_Диалоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Диалоги</name>
  <resources>
    <name>state</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>operator_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>client_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>transport</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Клиенты/C2D_Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Клиенты</name>
  <resources>
    <name>Клиент</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>avatar</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>assigned_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>client_phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолноеИмяТипаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/CommonModules/C2D_ВзаимодействиеСChat2DeskВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция ПолучитьНовыеСообщения(Пользователь) Экспорт
	МассивНовыхСообщений = новый Массив;
	НачатьТранзакцию();
	МассивID = РегистрыСведений.C2D_Операторы.НайтиIDПоСсылке(Пользователь);
	Попытка		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	C2D_Сообщения.Id КАК Id,
		               |	C2D_Сообщения.Текст КАК Текст,
		               |	C2D_Клиенты.Клиент КАК Клиент,
		               |	C2D_Клиенты.avatar КАК avatar,
		               |	C2D_Клиенты.name КАК name,
		               |	C2D_Клиенты.assigned_name КАК assigned_name,
		               |	C2D_Клиенты.phone КАК phone,
		               |	C2D_ОповещенияОператоров.Operator_id КАК Operator_id,
		               |	C2D_Клиенты.Представление КАК Представление,
		               |	C2D_Клиенты.ПолноеИмяТипаДанных КАК ПолноеИмяТипаДанных
		               |ИЗ
		               |	РегистрСведений.C2D_ОповещенияОператоров КАК C2D_ОповещенияОператоров
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_Сообщения КАК C2D_Сообщения
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_Диалоги КАК C2D_Диалоги
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_Клиенты КАК C2D_Клиенты
		               |				ПО (C2D_Клиенты.ID = C2D_Диалоги.client_id)
		               |			ПО (C2D_Диалоги.id = C2D_Сообщения.dialog_id)
		               |		ПО C2D_ОповещенияОператоров.IDСообщения = C2D_Сообщения.Id
		               |			И (C2D_ОповещенияОператоров.Operator_id В (&МассивID))
		               |			И (C2D_ОповещенияОператоров.Оповещен = ЛОЖЬ)";
		Запрос.УстановитьПараметр("МассивID", МассивID);
				
		Выборка = Запрос.Выполнить().Выгрузить();
		Для каждого Строка Из Выборка Цикл 
			Попытка
				СтруктураСообщения = Новый Структура("Текст, ПредставлениеКлиента");
				ЗаполнитьЗначенияСвойств(СтруктураСообщения, Строка);
				АдресАватара = ПоместитьВоВременноеХранилище(Новый Картинка(C2D_ВзаимодействиеСApiСлужебный.ПолучитьДвоичныеДанныеКартинки(Строка.avatar), Ложь)); 
				СтруктураСообщения.Вставить("Аватар", АдресАватара);
				СтруктураСообщения.Вставить("ПредставлениеКлиента", Строка.Представление);
				МассивНовыхСообщений.Добавить(СтруктураСообщения);
				РегистрыСведений.C2D_ОповещенияОператоров.СообщениеДоставлено(Строка.Id, Строка.Operator_id);
			Исключение
				//ОписаниеОшибки()
			КонецПопытки;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
	   ОтменитьТранзакцию();
	КонецПопытки;

	Возврат МассивНовыхСообщений;
	
КонецФункции

Функция C2D_НастройкаЗавершена() Экспорт
	Выборка = Справочники.C2D_Аккаунты.Выбрать();
	НАстройкаЗавершена = Выборка.Следующий() и выборка.НастройкаЗавершена;
	Возврат НАстройкаЗавершена; 	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
